# Model configuration for waste detection
# YOLOv5s architecture optimized for 5-class waste detection

# Model architecture
architecture:
  name: "YOLOv5s"
  backbone: "CSPDarknet"
  neck: "PANet"
  head: "YOLOv5 Detection Head"

# Model parameters
parameters:
  depth_multiple: 0.33    # model depth multiple
  width_multiple: 0.50    # layer channel multiple
  anchors:
    - [10,13, 16,30, 33,23]      # P3/8
    - [30,61, 62,45, 59,119]     # P4/16
    - [116,90, 156,198, 373,326] # P5/32

# Backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 6, 2, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 9, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 3, C3, [1024]]
  - [-1, 1, SPPF, [1024, 5]]            # 9

# Head
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [null, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]            # cat backbone P4
  - [-1, 3, C3, [512, False]]            # 13

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [null, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]            # cat backbone P3
  - [-1, 3, C3, [256, False]]            # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]           # cat head P4
  - [-1, 3, C3, [512, False]]            # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]           # cat head P5
  - [-1, 3, C3, [1024, False]]           # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [5, anchors]]  # Detect(P3, P4, P5) - 5 classes for waste detection

# Deployment optimizations
deployment:
  export_formats:
    - "pytorch"    # .pt
    - "onnx"       # .onnx
    - "tensorrt"   # .engine
  
  tensorrt:
    precision: "fp16"          # fp32, fp16, int8
    workspace_size: "1GB"      # TensorRT workspace size
    max_batch_size: 1          # Maximum batch size for inference
    
  jetson_optimizations:
    enable_dla: false          # Use Deep Learning Accelerator (Xavier/Orin)
    cpu_fallback: true         # Allow CPU fallback for unsupported layers
    optimize_for_throughput: true  # Optimize for inference speed